lisp-blog-guide.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<div id="outline-container-orgdf5465c" class="outline-3">
<h3 id="orgdf5465c">Try this asdfasdf asdf</h3>
<div class="outline-text-3" id="text-orgdf5465c">
<p>
123
</p>

<p>
asdf
</p>

<p>
sadf asdf
asdfasdf
asdfa
</p>
</div>
</div>

<div id="outline-container-org158f2dd" class="outline-2">
<h2 id="org158f2dd">asdfsdf</h2>
<div class="outline-text-2" id="text-org158f2dd">
<p>
sdf asdf
</p>

<p>
safd
</p>
</div>
</div>
<div id="outline-container-orged267fd" class="outline-2">
<h2 id="orged267fd">Lisp Blogging in Org</h2>
<div class="outline-text-2" id="text-orged267fd">
<p>
Today we will briefly discuss how to set up our own lisp blog, where we write in org-mode,
export to html and then publish to the web. We will be working mostly from
<a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">org-mode's official tutorial org-mode files to HTML</a>, and adapting it for our needs
as Lisp programmers.
</p>

<p>
To begin, let us scope out our requirements:
</p>

<ol class="org-ol">
<li>Creating blog posts entirely within org mode (from writing to publishing)</li>
<li>Minimising boilerplate</li>
<li>Custom Stylesheets</li>
<li>Adding comments that don't get published</li>
<li>Code formatting</li>
<li>Copy/Paste mechanism</li>
<li>Running code from org mode into SLIME</li>
<li>Separating html from org</li>
<li>Additional shortcuts to make our life easier</li>
<li>Basics of Org Mode</li>
</ol>

<p>
sdf
</p>

<p>
test this
</p>
</div>

<div id="outline-container-orgc029d95" class="outline-4">
<h4 id="orgc029d95">Emacs Configuration Settings</h4>
<div class="outline-text-4" id="text-orgc029d95">
<p>
s
</p>


<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">try</span> ()
  (what about this))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">hello</span> ()
  (print <span style="color: #8b2252;">"hello world"</span>))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">try</span> ()
  (+ 1 3))

(try)

</pre>
</div>

<p>
asdf
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: </p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
